test/bench/evidence/20260712-0216-b68391d14/e_write_fsync64-linux-r1.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.292998] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=1 fsync=64 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1)
p9write: (groupid=0, jobs=1): err= 0: pid=100: Sun Jul 12 02:20:30 2026
  write: IOPS=519, BW=520MiB/s (545MB/s)(1024MiB/1970msec); 0 zone resets
    clat (usec): min=58, max=1485, avg=311.28, stdev=222.08
     lat (usec): min=68, max=1528, avg=337.63, stdev=228.12
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   67], 10.00th=[   80], 20.00th=[  121],
     | 30.00th=[  147], 40.00th=[  196], 50.00th=[  258], 60.00th=[  322],
     | 70.00th=[  416], 80.00th=[  478], 90.00th=[  594], 95.00th=[  750],
     | 99.00th=[ 1012], 99.50th=[ 1139], 99.90th=[ 1303], 99.95th=[ 1483],
     | 99.99th=[ 1483]
   bw (  KiB/s): min=523241, max=591872, per=100.00%, avg=567238.33, stdev=38193.81, samples=3
   iops        : min=  510, max=  578, avg=553.33, stdev=37.65, samples=3
  lat (usec)   : 100=14.84%, 250=33.79%, 500=35.06%, 750=11.33%, 1000=3.91%
  lat (msec)   : 2=1.07%
  fsync/fdatasync/sync_file_range:
    sync (msec): min=54, max=148, avg=103.70, stdev=24.30
    sync percentiles (msec):
     |  1.00th=[   55],  5.00th=[   55], 10.00th=[   62], 20.00th=[   67],
     | 30.00th=[  108], 40.00th=[  109], 50.00th=[  111], 60.00th=[  111],
     | 70.00th=[  114], 80.00th=[  115], 90.00th=[  116], 95.00th=[  148],
     | 99.00th=[  148], 99.50th=[  148], 99.90th=[  148], 99.95th=[  148],
     | 99.99th=[  148]
  cpu          : usr=1.17%, sys=16.56%, ctx=218, majf=0, minf=0
  IO depths    : 1=101.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,15 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=520MiB/s (545MB/s), 520MiB/s-520MiB/s (545MB/s-545MB/s), io=1024MiB (1074MB), run=1970-1970msec
P9DONE write
P9ALLDONE
[    3.005138] reboot: Power down