test/bench/evidence/20260712-0216-b68391d14/nj_read_1m-linux-r1.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.298694] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=read rw=read bs=1M nj=1 fsync=0 size=1G
P9CASE read-cold
p9read-cold: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread

p9read-cold: (groupid=0, jobs=1): err= 0: pid=105: Sun Jul 12 02:22:03 2026
  read: IOPS=5197, BW=5198MiB/s (5450MB/s)(1024MiB/197msec)
    clat (usec): min=64, max=2318, avg=190.80, stdev=122.77
     lat (usec): min=64, max=2319, avg=190.89, stdev=122.82
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   77], 10.00th=[   87], 20.00th=[  112],
     | 30.00th=[  131], 40.00th=[  147], 50.00th=[  165], 60.00th=[  188],
     | 70.00th=[  212], 80.00th=[  247], 90.00th=[  314], 95.00th=[  379],
     | 99.00th=[  594], 99.50th=[  668], 99.90th=[  832], 99.95th=[ 2311],
     | 99.99th=[ 2311]
  lat (usec)   : 100=16.02%, 250=64.84%, 500=17.09%, 750=1.66%, 1000=0.29%
  lat (msec)   : 4=0.10%
  cpu          : usr=0.00%, sys=53.57%, ctx=870, majf=0, minf=256
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5198MiB/s (5450MB/s), 5198MiB/s-5198MiB/s (5450MB/s-5450MB/s), io=1024MiB (1074MB), run=197-197msec
P9DONE read-cold
P9CASE read-warm
p9read-warm: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread

p9read-warm: (groupid=0, jobs=1): err= 0: pid=108: Sun Jul 12 02:22:03 2026
  read: IOPS=9570, BW=9570MiB/s (10.0GB/s)(1024MiB/107msec)
    clat (usec): min=90, max=1493, avg=103.72, stdev=49.53
     lat (usec): min=90, max=1494, avg=103.78, stdev=49.57
    clat percentiles (usec):
     |  1.00th=[   92],  5.00th=[   92], 10.00th=[   93], 20.00th=[   93],
     | 30.00th=[   95], 40.00th=[   97], 50.00th=[   98], 60.00th=[   99],
     | 70.00th=[  101], 80.00th=[  104], 90.00th=[  111], 95.00th=[  118],
     | 99.00th=[  235], 99.50th=[  297], 99.90th=[  383], 99.95th=[ 1500],
     | 99.99th=[ 1500]
  lat (usec)   : 100=65.72%, 250=33.30%, 500=0.88%
  lat (msec)   : 2=0.10%
  cpu          : usr=0.00%, sys=97.17%, ctx=33, majf=0, minf=256
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9570MiB/s (10.0GB/s), 9570MiB/s-9570MiB/s (10.0GB/s-10.0GB/s), io=1024MiB (1074MB), run=107-107msec
P9DONE read-warm
P9ALLDONE
[    3.581679] reboot: Power down